zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_tuner.c
/***************************************************************************//**
* \file cy_capsense_tuner.c
* \version 10.0.0
*
* \brief
* This file provides the source code for the Tuner module functions.
*
********************************************************************************
* \copyright
* (c) 2018-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#include <stddef.h>
#include "cy_syslib.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_tuner.h"
#include "cy_capsense_control.h"
#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    #include "cy_capsense_sensing_lp.h"
    #include "cy_capsense_selftest_lp.h"
    #include "cy_capsense_generator_lp.h"
#endif
#include "cy_capsense_common.h"

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP))


/*******************************************************************************
* Function Name: Cy_CapSense_TuInitialize
****************************************************************************//**
*
* Initializes the communication interface with the CAPSENSE&trade; Tuner tool.
*
*******************************************************************************/
void Cy_CapSense_TuInitialize(cy_stc_capsense_context_t * context)
{
    volatile cy_stc_capsense_common_context_t * ptrCommonCxt = context->ptrCommonContext;
    ptrCommonCxt->tunerCmd = (uint16_t)CY_CAPSENSE_TU_CMD_NONE_E;
    ptrCommonCxt->tunerSt = (uint8_t)CY_CAPSENSE_TU_FSM_RUNNING;
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        ptrCommonCxt->lpDataSt = 0u;
        ptrCommonCxt->lpScanSt = 0u;
    #endif
}


/*******************************************************************************
* Function Name: Cy_CapSense_RunTuner
****************************************************************************//**
*
* Establishes synchronized operation between the CAPSENSE&trade; Middleware and 
* the CAPSENSE&trade; Tuner tool.
*
* This function is called periodically in the application program. It serves
* the CAPSENSE&trade; Tuner tool requests and commands to synchronize the operation. 
* Mostly, the best place to call this function is between processing and next 
* scanning.
* If the user changes some parameters in the Tuner tool, the middleware is 
* re-started - the Tuner issues a restart command to be executed by this
* function.
* 
* The Tuner interface supports two communication protocol: EZI2C and UART.
* 
* To use an EZI2C-based tuner interface, only initialization of the EZI2C 
* driver and interface is required in the application program. Refer to 
* the I2C driver documentation for details of the protocol implementation 
* and data package format by the EZI2C interface.
* 
* To use a UART-based tuner interface, the user must:
* * Initialize the UART driver and interface
* * Use a callback function to facilitate data transmission and reception 
*   using the UART driver.
* 
* The application program must: 
* * Form a transmission data packet
* * Validate the data package on receiver implementation prior to passing 
*   to the CAPSENSE&trade; Middleware.
* 
* The transmission packet includes a CAPSENSE&trade; context structure sandwiched 
* between a header (0x0D0A) and a tail (0x00FFFF), hence the package size 
* is dependent on CAPSENSE&trade; context information. The receiver packet is 
* 16-byte (fixed length) data explained under the 
* Cy_CapSense_CheckTunerCmdIntegrity() function. 
* The Cy_CapSense_CheckTunerCmdIntegrity() function is used to validate 
* the received data package prior to passing it to the CAPSENSE&trade; middleware.
* 
* Periodical calling the Cy_CapSense_RunTuner() function is:
* * mandatory for operation of a UART-based tuner interface. The middleware 
*   operation is always synchronous to the Tuner tool. 
* * optional for EZI2C based interface.
* 
* If the Cy_CapSense_RunTuner() function is not periodically called by 
* the application program, the middleware operation is asynchronous to 
* the Tuner tool and the following disadvantages are applicable:
* * The raw counts displayed in the CAPSENSE&trade; Tuner tool may be filtered 
*   and/or non-filtered. Result - noise and SNR measurements are not accurate.
* * The CAPSENSE&trade; Tuner tool can read sensor data (such as raw counts) from 
*   a scan multiply. Result - noise and SNR measurement are not accurate.
* * The CAPSENSE&trade; Tuner tool and Host controller should not change the 
*   parameters via the Tuner interface - in async mode this leads to
*   abnormal behaviour.
* * Displaying detected gestures may be missed.
* * The raw counts of CSX and/or ISX sensors may be non-inverted.
*
* \warning 
* This function executes received commands. Two commands 
* CY_CAPSENSE_TU_CMD_ONE_SCAN_E and CY_CAPSENSE_TU_CMD_SUSPEND_E change 
* the FW tuner module state to suspend. In this state, the function waits 
* until CY_CAPSENSE_TU_CMD_RESUME_E is received. Use a callback mechanism 
* of command receiving to avoid FW hanging. Refer to 
* the Function Usage section for examples.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* The return parameter indicates whether a middleware re-start was executed 
* by this function or not:
* - CY_CAPSENSE_STATUS_RESTART_DONE - Based on a received command, the
* CAPSENSE&trade; was re-initialized.
* - CY_CAPSENSE_STATUS_RESTART_NONE - Re-start was not executed by this
* function.
*
* \funcusage
* 
* An example of synchronization with the Tuner tool using EzI2C interface:
*
* -# In the Device Configurator, enable the SCB resource in the EzI2C mode
*    with the "EZI2C" name. Configure interface parameters, assign required
*    clock source and pins. Note that in the CapSense Tuner tool, I2C
*    interface settings should match device EzI2C configuration.
*
* -# Declare EzI2C interface context:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_EZI2C_Context
*
* -# Setup EzI2C interrupt handler:
*    \snippet capsense/snippet/main.c snippet_Tuner_EzI2C_Isr
*
* -# Configure EzI2C buffer and use EzI2C as the tuner interface:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_Tuner_EzI2C
* 
*
* An example of synchronization with the Tuner tool using UART interface:
*
* -# In the Device Configurator, enable the SCB resource in the UART mode
*    with the "UART" name. Configure interface parameters, assign required
*    clock source and pins. Note that in the CapSense Tuner tool, UART
*    interface settings should match device UART configuration.
*
* -# Declare UART interface context:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_UART_Context
*
* -# Setup UART interrupt handler:
*    \snippet capsense/snippet/main.c snippet_Tuner_Uart_Isr
*
* -# Add Send callback implementation:
*    \snippet capsense/snippet/main.c snippet_TunerSend
*
* -# Add Receive callback implementation:
*    \snippet capsense/snippet/main.c snippet_TunerReceive
*
* -# Configure UART RX ring buffer and register Send and Receive callbacks
*    as a part of the main.c FW flow:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_Tuner_UART
* 
* Refer to the \ref group_capsense_callbacks section for details.
*
* \note
* For the fifth-generation Low Power CAPSENSE&trade; you may encounter issue with
* the Tuner tool connection establishment for both EZI2C and UART interfaces.
* This may happen due to usage of the Sleep or Deep Sleep power modes during
* the scan operation. Depending on the project configuration, scan length may
* exceed the Tuner tool connection timeout.
* Since the Tuner tool resets the device during the connection establishment,
* you can add following code to your application after the communication interface
* initialization and before the main loop to eliminate the issue:
*
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_Tuner_Delay
*
*******************************************************************************/
uint32_t Cy_CapSense_RunTuner(cy_stc_capsense_context_t * context)
{
    uint32_t interruptState;
    uint32_t updateFlag = 0u;
    uint32_t tunerStatus = CY_CAPSENSE_STATUS_RESTART_NONE;
    uint16_t tunerCommand;
    uint32_t cmdOffset;
    uint32_t cmdSize;
    uint8_t cmdCounter;

