zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_tuner.c
    uint8_t * tunerStructure = NULL;
    uint8_t * commandPacket = NULL;
    volatile cy_stc_capsense_common_context_t * ptrCommonCxt = context->ptrCommonContext;
    uint8_t tunerState = ptrCommonCxt->tunerSt;

    cy_capsense_tuner_send_callback_t sendCallback = context->ptrInternalContext->ptrTunerSendCallback;
    cy_capsense_tuner_receive_callback_t receiveCallback = context->ptrInternalContext->ptrTunerReceiveCallback;

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint32_t widgetId;
        uint32_t sendDataFlag = 1u;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
        const cy_stc_capsense_widget_config_t * ptrWdCfg;
        uint16_t duty_cycle = 0u;
    #endif

    do
    {
        /*
        * ONE_SCAN command could be interpreted as two commands:
        * RESUME till next call of this function and then
        * SUSPEND till next command receiving.
        * So, after one scan cycle tuner state is changed to suspend.
        */
        if ((uint8_t)CY_CAPSENSE_TU_FSM_ONE_SCAN == tunerState)
        {
            interruptState = Cy_SysLib_EnterCriticalSection();
            context->ptrCommonContext->tunerCmd = (uint16_t)CY_CAPSENSE_TU_CMD_SUSPEND_E;
            Cy_SysLib_ExitCriticalSection(interruptState);
        }

        /* Send Data to the CAPSENSE&trade; Tuner tool */
        #if ((CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN))
            if (NULL != sendCallback)
            {
                sendCallback((void *)context);
            }
        #endif

        /* Command can come from EzI2C by direct writing into data structure */
        tunerCommand = context->ptrCommonContext->tunerCmd;
        cmdCounter = context->ptrCommonContext->tunerCnt + 1u;

        /* Call user's callback function if it is registered */
        if (NULL != receiveCallback)
        {
            commandPacket = NULL;
            tunerStructure = NULL;
            receiveCallback(&commandPacket, &tunerStructure, context);

            /* If command exists and is correct then read command */
            if ((NULL != commandPacket) && (NULL != tunerStructure))
            {
                if (CY_CAPSENSE_COMMAND_OK == Cy_CapSense_CheckTunerCmdIntegrity(commandPacket))
                {
                    tunerCommand = commandPacket[CY_CAPSENSE_COMMAND_CODE_0_IDX];
                    ptrCommonCxt->tunerCmd = tunerCommand;
                    cmdCounter = commandPacket[CY_CAPSENSE_COMMAND_CNTR_0_IDX];
                }
            }
        }

        /* Check command register */
        switch (tunerCommand)
        {
            case (uint16_t)CY_CAPSENSE_TU_CMD_SUSPEND_E:
                tunerState = (uint8_t)CY_CAPSENSE_TU_FSM_SUSPENDED;
                updateFlag = 1u;
                break;

            case (uint16_t)CY_CAPSENSE_TU_CMD_RESUME_E:
                tunerState = (uint8_t)CY_CAPSENSE_TU_FSM_RUNNING;
                updateFlag = 1u;
                break;

            case (uint16_t)CY_CAPSENSE_TU_CMD_RESTART_E:
                (void)Cy_CapSense_Enable(context);
                tunerStatus = CY_CAPSENSE_STATUS_RESTART_DONE;
                tunerState = (uint8_t)CY_CAPSENSE_TU_FSM_RUNNING;
                updateFlag = 1u;
                break;

            case (uint16_t)CY_CAPSENSE_TU_CMD_RESTART_ONLY_E:
                (void)Cy_CapSense_Enable(context);
                tunerStatus = CY_CAPSENSE_STATUS_RESTART_DONE;
                updateFlag = 1u;
                break;

            case (uint16_t)CY_CAPSENSE_TU_CMD_PING_E:
                #if ((CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN))
                    tunerState = (uint8_t)CY_CAPSENSE_TU_FSM_RUNNING;
                #endif
                updateFlag = 1u;
                break;

            case (uint16_t)CY_CAPSENSE_TU_CMD_ONE_SCAN_E:
                tunerState = (uint8_t)CY_CAPSENSE_TU_FSM_ONE_SCAN;
                updateFlag = 0u;
                #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                    sendDataFlag = 0u;
                #endif
                break;

            case (uint16_t)CY_CAPSENSE_TU_CMD_WRITE_E:
                if ((NULL != receiveCallback) && (NULL != commandPacket) && (NULL != tunerStructure))
                {
                    /* Tuner state is not changed */
                    cmdOffset = (uint32_t)((uint32_t)commandPacket[CY_CAPSENSE_COMMAND_OFFS_0_IDX] << CY_CAPSENSE_MSB_SHIFT) |
                                           (uint32_t)commandPacket[CY_CAPSENSE_COMMAND_OFFS_1_IDX];
                    cmdSize = commandPacket[CY_CAPSENSE_COMMAND_SIZE_0_IDX];

                    if (1u == cmdSize)
                    {
                        tunerStructure[cmdOffset] = commandPacket[CY_CAPSENSE_COMMAND_DATA_0_IDX + 3u];
                    }
                    else if (2u == cmdSize)
                    {
                        tunerStructure[cmdOffset + 1u] = commandPacket[CY_CAPSENSE_COMMAND_DATA_0_IDX + 2u];
                        tunerStructure[cmdOffset + 0u] = commandPacket[CY_CAPSENSE_COMMAND_DATA_0_IDX + 3u];
                    }
                    else
                    {
                        tunerStructure[cmdOffset + 3u] = commandPacket[CY_CAPSENSE_COMMAND_DATA_0_IDX + 0u];
                        tunerStructure[cmdOffset + 2u] = commandPacket[CY_CAPSENSE_COMMAND_DATA_0_IDX + 1u];
                        tunerStructure[cmdOffset + 1u] = commandPacket[CY_CAPSENSE_COMMAND_DATA_0_IDX + 2u];
                        tunerStructure[cmdOffset + 0u] = commandPacket[CY_CAPSENSE_COMMAND_DATA_0_IDX + 3u];
                    }

                    updateFlag = 1u;
                }
                break;

            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                case (uint16_t)CY_CAPSENSE_TU_CMD_COMM_DIS_E:
                    context->ptrCommonContext->lpDataSt &= (uint16_t)(~CY_CAPSENSE_LP_PROCESS_ENABLED_MASK);
                    updateFlag = 1u;
                    break;

                case (uint16_t)CY_CAPSENSE_TU_CMD_COMM_EN_E:
                    context->ptrCommonContext->lpDataSt |= (uint16_t)CY_CAPSENSE_LP_PROCESS_ENABLED_MASK;
                    tunerState = (uint8_t)CY_CAPSENSE_TU_FSM_SUSPENDED;
                    updateFlag = 1u;
                    break;
            #endif

