zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_tuner.c
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
                case (uint16_t)CY_CAPSENSE_TU_CMD_SET_DUTY_CYCLE_AND_SCAN_E:
                    if (NULL != commandPacket)
                    {
                        tunerState = (uint8_t)CY_CAPSENSE_TU_FSM_ONE_SCAN;
                        updateFlag = 0u;
                        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                            sendDataFlag = 0u;
                        #endif

                        cmdSize = commandPacket[CY_CAPSENSE_COMMAND_SIZE_0_IDX];
                        duty_cycle = 0u;
                        if (2u == cmdSize)
                        {
                            duty_cycle = (((uint16_t)commandPacket[CY_CAPSENSE_COMMAND_DATA_0_IDX + 2u]) << 8u) |
                                        ((uint16_t)commandPacket[CY_CAPSENSE_COMMAND_DATA_0_IDX + 3u]);
                        }

                        for (widgetId = 0u; widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT; widgetId++)
                        {
                            ptrWdCfg = &context->ptrWdConfig[widgetId];

                            if (((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E == ptrWdCfg->wdType) ||
                                ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E == ptrWdCfg->wdType))
                            {
                                if (0u != (ptrWdCfg->centroidConfig & CY_CAPSENSE_LLW_FOAM_EN_MASK))
                                {
                                    ptrWdCfg->ptrWdContext->sigPFC = duty_cycle;
                                }
                            }
                        }
                    }
                    break;
            #endif

            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CALIBRATION_EN)
                    case (uint16_t)CY_CAPSENSE_TU_CMD_CALIBRATE_WIDGET_BLOCKING_E:
                        widgetId = (uint32_t)context->ptrCommonContext->misc & CY_CAPSENSE_WD_MAX_NUMBER_MASK;
                        if (CY_CAPSENSE_TOTAL_WIDGET_COUNT > widgetId)
                        {
                            (void)Cy_CapSense_CalibrateWidget_V3Lp(widgetId, context);
                            updateFlag = 1u;
                        }
                        break;
                #endif

                case (uint16_t)CY_CAPSENSE_TU_CMD_SCAN_WIDGET_BLOCKING_E:
                    widgetId = (uint32_t)context->ptrCommonContext->misc & CY_CAPSENSE_WD_MAX_NUMBER_MASK;
                    if (CY_CAPSENSE_TOTAL_WIDGET_COUNT > widgetId)
                    {
                        (void)Cy_CapSense_ScanWidget_V3Lp(widgetId, context);
                        (void)Cy_CapSense_WaitEndScan(1000000uL, context);  /* 1 sec timeout per widget */
                        updateFlag = 1u;
                    }
                    break;

                #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
                    case (uint16_t)CY_CAPSENSE_TU_CMD_BIST_UPDATE_WIDGET_CRC_E:
                        widgetId = (uint32_t)context->ptrCommonContext->misc & CY_CAPSENSE_WD_MAX_NUMBER_MASK;
                        if (CY_CAPSENSE_TOTAL_WIDGET_COUNT > widgetId)
                        {
                            /* Update CRC if BIST is enabled */
                            Cy_CapSense_UpdateCrcWidget(widgetId, context);
                            updateFlag = 1u;
                        }
                        break;
                #endif

                case (uint16_t)CY_CAPSENSE_TU_CMD_APPLY_CDACS_WIDGET_E:
                    widgetId = (uint32_t)context->ptrCommonContext->misc & CY_CAPSENSE_WD_MAX_NUMBER_MASK;
                    if (CY_CAPSENSE_TOTAL_WIDGET_COUNT > widgetId)
                    {
                        Cy_CapSense_ApplyWidgetCdacParam(widgetId, context);
                        updateFlag = 1u;
                    }
                    break;

            #endif

            default:
                /* No action on other commands */
                break;
        }

        ptrCommonCxt->tunerSt = tunerState;

        /* Set Complete flag in command register if needed */
        if (0u != updateFlag)
        {
            interruptState = Cy_SysLib_EnterCriticalSection();
            /* Check that command wasn't overwritten with new command */
            if (tunerCommand == ptrCommonCxt->tunerCmd)
            {
                ptrCommonCxt->tunerCmd |= CY_CAPSENSE_TU_CMD_COMPLETE_BIT;
                ptrCommonCxt->tunerCnt = cmdCounter;
            }
            Cy_SysLib_ExitCriticalSection(interruptState);
        }

        /* Send Data to the CAPSENSE&trade; Tuner tool */
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            if ((NULL != sendCallback) &&
                ((0u != updateFlag) || (0u != sendDataFlag)))
            {
                sendCallback((void *)context);
                sendDataFlag = 0u;
            }
        #endif

        updateFlag = 0u;

    } while ((uint8_t)CY_CAPSENSE_TU_FSM_SUSPENDED == tunerState);

    return tunerStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CheckTunerCmdIntegrity
****************************************************************************//**
*
* Checks command format, header, tail, CRC, etc.
*
* This function checks whether the specified packet with the size
* CY_CAPSENSE_COMMAND_PACKET_SIZE could be represented as a
* command received from the CAPSENSE&trade; Tuner tool.
* The verification includes the following items:
* * Header
* * Tail
* * CRC
* * Command code
*
* Command format is the following:
* * Byte  0: Header 0 = 0x0D
* * Byte  1: Header 1 = 0x0A
* * Byte  2: Command code = cy_en_capsense_tuner_cmd_t
* * Byte  3: Command counter
* * Byte  4: Size = either 1, 2 or 4
* * Byte  5: Offset MSB
* * Byte  6: Offset LSB
* * Byte  7: Data MSB
* * Byte  8: Data
* * Byte  9: Data
* * Byte 10: Data LSB
* * Byte 11: 16-bit CRC MSB
* * Byte 12: 16-bit CRC LSB
* * Byte 13: Tail 0 = 0x00
* * Byte 14: Tail 1 = 0xFF
* * Byte 15: Tail 2 = 0xFF
*
* \param commandPacket
* The pointer to the data packet that should be verified.
*
* \return
* Returns the result of the command verification:
* - CY_CAPSENSE_COMMAND_OK - Command is correct.
* - CY_CAPSENSE_WRONG_HEADER - Wrong header.
* - CY_CAPSENSE_WRONG_TAIL - Wrong tail.
* - CY_CAPSENSE_WRONG_CRC - Wrong CRC.
* - CY_CAPSENSE_WRONG_CODE - Wrong Command code.
*
*******************************************************************************/
uint32_t Cy_CapSense_CheckTunerCmdIntegrity(const uint8_t * commandPacket)
{
    uint32_t cmdCheckStatus = CY_CAPSENSE_COMMAND_OK;
    uint16_t crcValue;

    if (CY_CAPSENSE_COMMAND_HEAD_0 != commandPacket[CY_CAPSENSE_COMMAND_HEAD_0_IDX])
    {
        cmdCheckStatus = CY_CAPSENSE_WRONG_HEADER;
    }
    else if (CY_CAPSENSE_COMMAND_HEAD_1 != commandPacket[CY_CAPSENSE_COMMAND_HEAD_1_IDX])
    {
        cmdCheckStatus = CY_CAPSENSE_WRONG_HEADER;
    }
    else if (CY_CAPSENSE_COMMAND_TAIL_0 != commandPacket[CY_CAPSENSE_COMMAND_TAIL_0_IDX])
    {
        cmdCheckStatus = CY_CAPSENSE_WRONG_TAIL;
    }
    else if (CY_CAPSENSE_COMMAND_TAIL_1 != commandPacket[CY_CAPSENSE_COMMAND_TAIL_1_IDX])
    {
        cmdCheckStatus = CY_CAPSENSE_WRONG_TAIL;
    }
    else if (CY_CAPSENSE_COMMAND_TAIL_2 != commandPacket[CY_CAPSENSE_COMMAND_TAIL_2_IDX])
    {
        cmdCheckStatus = CY_CAPSENSE_WRONG_TAIL;
    }
    else if (((uint8_t)CY_CAPSENSE_TU_CMD_LAST_E - 1u) < commandPacket[CY_CAPSENSE_COMMAND_CODE_0_IDX])
    {
        cmdCheckStatus = CY_CAPSENSE_WRONG_CODE;
    }
    else
    {
        crcValue = (uint16_t)((uint16_t)commandPacket[CY_CAPSENSE_COMMAND_CRC_0_IDX] << CY_CAPSENSE_MSB_SHIFT);
        crcValue |= (uint16_t)commandPacket[CY_CAPSENSE_COMMAND_CRC_1_IDX];
        if (crcValue != Cy_CapSense_GetCRC(&commandPacket[0u], CY_CAPSENSE_COMMAND_CRC_DATA_SIZE))
        {
            cmdCheckStatus = CY_CAPSENSE_WRONG_CRC;
        }
    }

    return cmdCheckStatus;
}

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP)) */


/* [] END OF FILE */
